# 함수 관련 기본 용어
## 코드 전체: program, routine(+ procedure, method)
## 다른 의미로 변경: procedure, method
pro: 미리 또는 앞으로
예) prophet: 미리 + 말하는 것 = 예언자
예) proceed: 앞으로 + 가다 = 나아가다

gram: 작성된 것
예) instagram: 즉시, 즉석으로, 바로, 순간 + 작성한 것

program: 미리 + 작성된 것 = 미리 작성된 것

# 작은코드: 서브루틴, 서브프로그램, 다른 의미로 변경: 프로시저, 메서드
 => 큰 프로그램 안에 작은 프로그램

# 매개변수(parameter)
 : 함수의 괄호 내부에 입력하는 변수

# 절차(procedure): 매개변수를 갖는 서브루틴/서브프로그램
 ex) 이름(100), 이름은 함수(def)

# 함수: 리턴 값을 갖는 프로시저

# 메서드: 클래스 내부에 있는 함수

#ADA: 프로시저 문법과 함수 문법이 완전히 분리!

#현대적인 프로그래밍 언어: 함수로 통합!

#파이썬: 함수로 통합